In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.read_csv('stroke prediction.csv')

In [ ]:
data.head()

      id  gender   age  ...   bmi   smoking_status stroke
0  30669    Male   3.0  ...  18.0              NaN      0
1  30468    Male  58.0  ...  39.2     never smoked      0
2  16523  Female   8.0  ...  17.6              NaN      0
3  56543  Female  70.0  ...  35.9  formerly smoked      0
4  46136    Male  14.0  ...  19.1              NaN      0

[5 rows x 12 columns]

In [ ]:
bins = [0,12,19,30,60,90]
group =['child' ,'teenager' ,'young adult' ,'middle aged' ,'senior citizen']
data['age_category']=pd.cut(data['age'] , bins ,labels=group)

In [ ]:
data[['age','age_category']].head()

    age    age_category
0   3.0           child
1  58.0     middle aged
2   8.0           child
3  70.0  senior citizen
4  14.0        teenager

#Binning using decision tree

In [ ]:
bins=[0,49.5,66.5,77.5,90]
group =['bin1' ,'bin2' ,'bin3' ,'bin4']
data['D_t_binning']=pd.cut(data['age'] , bins,labels=group)

In [ ]:
data[['age' , 'D_t_binning']].head()

    age D_t_binning
0   3.0        bin1
1  58.0        bin2
2   8.0        bin1
3  70.0        bin3
4  14.0        bin1

In [ ]:
df = pd.read_csv('train_bm.csv')
df.head()

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15         9.30  ...  Supermarket Type1          3735.1380
1           DRC01         5.92  ...  Supermarket Type2           443.4228
2           FDN15        17.50  ...  Supermarket Type1          2097.2700
3           FDX07        19.20  ...      Grocery Store           732.3800
4           NCD19         8.93  ...  Supermarket Type1           994.7052

[5 rows x 12 columns]

In [ ]:
df['Item_Type'].value_counts()

Fruits and Vegetables    1232
Snack Foods              1200
Household                 910
Frozen Foods              856
Dairy                     682
Canned                    649
Baking Goods              648
Health and Hygiene        520
Soft Drinks               445
Meat                      425
Breads                    251
Hard Drinks               214
Others                    169
Starchy Foods             148
Breakfast                 110
Seafood                    64
Name: Item_Type, dtype: int64

In [ ]:
temp = df['Item_Type'].value_counts()

In [ ]:
df['Item_Type_count1']=df['Item_Type'].apply(lambda x:temp[x])
df[['Item_Identifier', 'Item_Type', 'Item_Type_count1']]

     Item_Identifier              Item_Type  Item_Type_count1
0              FDA15                  Dairy               682
1              DRC01            Soft Drinks               445
2              FDN15                   Meat               425
3              FDX07  Fruits and Vegetables              1232
4              NCD19              Household               910
...              ...                    ...               ...
8518           FDF22            Snack Foods              1200
8519           FDS36           Baking Goods               648
8520           NCJ29     Health and Hygiene               520
8521           FDN46            Snack Foods              1200
8522           DRG01            Soft Drinks               445

[8523 rows x 3 columns]